OdGiLinetype.setDashes(OdArray&lt;OdGiLinetypeDash,OdObjectsAllocator&lt;OdGiLinetypeDash&gt;&gt;!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets dashes for this linetype.
\param dashes [in]  Linetype dashes to set.

OdGiLinetype.dashes(OdArray&lt;OdGiLinetypeDash,OdObjectsAllocator&lt;OdGiLinetypeDash&gt;&gt;*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Retrieves dashes of this linetype.
\param dashes [out]  Receives linetype dashes.

OdGiLinetype.setDashAt(System.Int32,OdGiLinetypeDash!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Sets the dash at the specified index.
\param index [in]  Dash index.
\param dash [out]  Linetype dash to set.

OdGiLinetype.setDashAt(System.Int32,System.Double)
\details
Sets the dash at the specified index.
\param index [in]  Dash index.
\param value [out]  Dash length.

OdGiLinetype.dashAt(System.Int32)
\details
Retrieves the dash at the specified index.
\param index [in]  Dash index.
\returns
reference to the OdGiLinetypeDash instance which represents the dash.

OdGiLinetype.dashAt(System.Int32,OdGiLinetypeDash*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Retrieves the dash at the specified index.
\param index [in]  Dash index.
\param dash [out]  Receives the dash.

OdGiLinetype.setNumDashes(System.Int32)
\details
Specifies the number of dashes for this linetype.
\param count [in]  Number of dashes in the pattern.

OdGiLinetype.numDashes
\details
Retrieves the number of dashes of this linetype.
\returns
quantity of dashes as integer value.

OdGiLinetype.setPatternLength(System.Double)
\details
Retrieves the overall length of this linetype pattern.
\param patternLength [in]  Overall pattern length.

OdGiLinetype.patternLength
\details
Retrieves the overall length of this linetype pattern.
\returns
pattern length as a value of the double type.

OdGiLinetype.setByLayer(System.Boolean)
\details
Specifies whether this linetype should inherit linetype parameters provided by the block definition.
\param value [in]  Flag that specifies whether this linetype should be inherited by layer.

OdGiLinetype.isByLayer
\details
Checks whether this linetype is inherited by the layer.
\returns
true if this linetype is inherited by the layer, false otherwise.

OdGiLinetype.setByBlock(System.Boolean)
\details
Specifies whether this linetype should inherit linetype parameters provided by the block definition.
\param value [in]  Flag that specifies whether this linetype should be inherited by block.

OdGiLinetype.isByBlock
\details
Checks whether this linetype is inherited by the block definition.
\returns
true if this linetype is inherited by the block definition, false otherwise.

OdGiLinetype.isContinuous
\details
Checks whether this linetype is continuous (linetype has no dashes).
\returns
true if this linetype is continuous, false otherwise.

OdGiLinetype.#ctor
\details
Default constructor for the OdGiLinetype class. Sets the flag that specifies that pattern length is valid and set pattern length to 0.